In [1]:
import preprocessingFuncts as pp
import pandas as pd
import numpy as np

In [2]:
b= pp.Unweighteduserdata("gender")
for n in b:
    display(n)

In [3]:
b= pp.Unweighteduserdata("occupation")
for n in b:
    display(n)

In [4]:
b= pp.Unweighteduserdata("age_group")
for n in b:
    display(n)

In [5]:
a = pp.Weighteduserdata(30,"gender")
for i in a:
    display(i)

In [6]:
a = pp.Weighteduserdata(30,"occupation")
for i in a:
    display(i)

In [7]:
a = pp.Weighteduserdata(30,"age_group")
for i in a:
    display(i)

In [52]:
#["unknown", "Action", "Adventure", "Animation", "Children's","Comedy", "Crime", "Documentary", "Drama", "Fantasy", "Film-Noir", "Horror", "Musical", "Mystery", "Romance", "Sci-Fi", "Thriller", "War", "Western"]
c= pp.Weighteditemdata(30,"unknown")
for x in c:
    display(x)
# d= pp.Unweighteditemdata("Action")
# for y in d:
#     display(y)

Weighted data for Unknown genre does not exist

TypeError: 'NoneType' object is not iterable

In [13]:
#["unknown", "Action", "Adventure", "Animation", "Children's","Comedy", "Crime", "Documentary", "Drama", "Fantasy", "Film-Noir", "Horror", "Musical", "Mystery", "Romance", "Sci-Fi", "Thriller", "War", "Western"]
c= pp.Weighteditemdata(30,"Action")
for x in c:
    display(x)
# d= pp.Unweighteditemdata("Action")
# for y in d:
#     display(y)

                item_id                            title
average_rating
4.358491             50                 Star Wars (1977)
4.283293            127            Godfather, The (1972)
4.252381            174   Raiders of the Lost Ark (1981)
4.245714            313                   Titanic (1997)
4.204360            172  Empire Strikes Back, The (1980)

                item_id                               title
average_rating
1.933333           1215                    Barb Wire (1996)
1.948718            743    Crow: City of Angels, The (1996)
1.953488            890  Mortal Kombat: Annihilation (1997)
2.131579           1089      Speed 2: Cruise Control (1997)
2.289474           1013                     Anaconda (1997)

In [14]:
#["unknown", "Action", "Adventure", "Animation", "Children's","Comedy", "Crime", "Documentary", "Drama", "Fantasy", "Film-Noir", "Horror", "Musical", "Mystery", "Romance", "Sci-Fi", "Thriller", "War", "Western"]
c= pp.Weighteditemdata(30,"Adventure")
for x in c:
    display(x)
# d= pp.Unweighteditemdata("Action")
# for y in d:
#     display(y)

                item_id                            title
average_rating
4.358491             50                 Star Wars (1977)
4.252381            174   Raiders of the Lost Ark (1981)
4.231214            511        Lawrence of Arabia (1962)
4.204360            172  Empire Strikes Back, The (1980)
4.184211            498        African Queen, The (1951)

                item_id                                   title
average_rating
1.953488            890      Mortal Kombat: Annihilation (1997)
2.289474           1013                         Anaconda (1997)
2.396825            450  Star Trek V: The Final Frontier (1989)
2.451613            254                   Batman & Robin (1997)
2.452381            769                            Congo (1995)

In [15]:
#["unknown", "Action", "Adventure", "Animation", "Children's","Comedy", "Crime", "Documentary", "Drama", "Fantasy", "Film-Noir", "Horror", "Musical", "Mystery", "Romance", "Sci-Fi", "Thriller", "War", "Western"]
c= pp.Weighteditemdata(30,"Animation")
for x in c:
    display(x)
# d= pp.Unweighteditemdata("Action")
# for y in d:
#     display(y)

                item_id                                              title
average_rating
4.491071            408                              Close Shave, A (1995)
4.466102            169                         Wrong Trousers, The (1993)
4.447761            114  Wallace & Gromit: The Best of Aardman Animatio...
4.106061            189                            Grand Day Out, A (1992)
3.878319              1                                   Toy Story (1995)

                item_id                                   title
average_rating
2.529412            542                       Pocahontas (1995)
2.720930           1091                    Pete's Dragon (1977)
2.774194            820                        Space Jam (1996)
2.788462            240  Beavis and Butt-head Do America (1996)
2.843750            989     Transformers: The Movie, The (1986)

In [16]:
#["unknown", "Action", "Adventure", "Animation", "Children's","Comedy", "Crime", "Documentary", "Drama", "Fantasy", "Film-Noir", "Horror", "Musical", "Mystery", "Romance", "Sci-Fi", "Thriller", "War", "Western"]
c= pp.Weighteditemdata(30,"Children's")
for x in c:
    display(x)
# d= pp.Unweighteditemdata("Action")
# for y in d:
#     display(y)

                item_id                              title
average_rating
4.077236            132           Wizard of Oz, The (1939)
3.995434              8                        Babe (1995)
3.903226            500               Fly Away Home (1996)
3.878319              1                   Toy Story (1995)
3.833333            423  E.T. the Extra-Terrestrial (1982)

                item_id                    title
average_rating
2.064516            383  Flintstones, The (1994)
2.439394            243     Jungle2Jungle (1997)
2.454545             78        Free Willy (1993)
2.477273            539        Mouse Hunt (1997)
2.515152            878    That Darn Cat! (1997)

In [17]:
#["unknown", "Action", "Adventure", "Animation", "Children's","Comedy", "Crime", "Documentary", "Drama", "Fantasy", "Film-Noir", "Horror", "Musical", "Mystery", "Romance", "Sci-Fi", "Thriller", "War", "Western"]
c= pp.Weighteditemdata(30,"Comedy")
for x in c:
    display(x)
# d= pp.Unweighteditemdata("Action")
# for y in d:
#     display(y)

                item_id                       title
average_rating
4.491071            408       Close Shave, A (1995)
4.466102            169  Wrong Trousers, The (1993)
4.284916            480   North by Northwest (1959)
4.260870            251      Shall We Dance? (1996)
4.196429            316   As Good As It Gets (1997)

                item_id                      title
average_rating
1.840909            688  Leave It to Beaver (1997)
1.903226            368            Bio-Dome (1996)
2.064516            383    Flintstones, The (1994)
2.166667            948          Booty Call (1997)
2.188406            687       McHale's Navy (1997)

In [18]:
#["unknown", "Action", "Adventure", "Animation", "Children's","Comedy", "Crime", "Documentary", "Drama", "Fantasy", "Film-Noir", "Horror", "Musical", "Mystery", "Romance", "Sci-Fi", "Thriller", "War", "Western"]
c= pp.Weighteditemdata(30,"Crime")
for x in c:
    display(x)
# d= pp.Unweighteditemdata("Action")
# for y in d:
#     display(y)

                item_id                           title
average_rating
4.385768             12      Usual Suspects, The (1995)
4.283293            127           Godfather, The (1972)
4.186603            187  Godfather: Part II, The (1974)
4.161616            302        L.A. Confidential (1997)
4.155512            100                    Fargo (1996)

                item_id                  title
average_rating
2.238806            120      Striptease (1996)
2.451613            254  Batman & Robin (1997)
2.606061           1139         Hackers (1995)
2.627907            336     Playing God (1997)
2.666667             29  Batman Forever (1995)

In [19]:
#["unknown", "Action", "Adventure", "Animation", "Children's","Comedy", "Crime", "Documentary", "Drama", "Fantasy", "Film-Noir", "Horror", "Musical", "Mystery", "Romance", "Sci-Fi", "Thriller", "War", "Western"]
c= pp.Weighteditemdata(30,"Documentary")
for x in c:
    display(x)
# d= pp.Unweighteditemdata("Action")
# for y in d:
#     display(y)

                item_id                         title
average_rating
4.094017             48            Hoop Dreams (1994)
4.045455           1142     When We Were Kings (1996)
3.892857            813  Celluloid Closet, The (1995)
3.790123             32                  Crumb (1994)
3.771429            644    Thin Blue Line, The (1988)

                item_id                                title
average_rating
3.437500           1022  Fast, Cheap & Out of Control (1997)
3.490566           1065                 Koyaanisqatsi (1983)
3.727273            847           Looking for Richard (1996)
3.771429            644           Thin Blue Line, The (1988)
3.790123             32                         Crumb (1994)

In [20]:
#["unknown", "Action", "Adventure", "Animation", "Children's","Comedy", "Crime", "Documentary", "Drama", "Fantasy", "Film-Noir", "Horror", "Musical", "Mystery", "Romance", "Sci-Fi", "Thriller", "War", "Western"]
c= pp.Weighteditemdata(30,"Drama")
for x in c:
    display(x)
# d= pp.Unweighteditemdata("Action")
# for y in d:
#     display(y)

                item_id                             title
average_rating
4.466443            318           Schindler's List (1993)
4.456790            483                 Casablanca (1942)
4.445230             64  Shawshank Redemption, The (1994)
4.344000            178               12 Angry Men (1957)
4.292929            134               Citizen Kane (1941)

                item_id                     title
average_rating
2.454545             78         Free Willy (1993)
2.546875            325              Crash (1996)
2.625000           1132  Feeling Minnesota (1996)
2.660377            840  Last Man Standing (1996)
2.701493            569               Wolf (1994)

In [21]:
#["unknown", "Action", "Adventure", "Animation", "Children's","Comedy", "Crime", "Documentary", "Drama", "Fantasy", "Film-Noir", "Horror", "Musical", "Mystery", "Romance", "Sci-Fi", "Thriller", "War", "Western"]
c= pp.Weighteditemdata(30,"Fantasy")
for x in c:
    display(x)
# d= pp.Unweighteditemdata("Action")
# for y in d:
#     display(y)

                item_id                                title
average_rating
3.833333            423    E.T. the Extra-Terrestrial (1982)
3.671429            558            Heavenly Creatures (1994)
3.500000            141  20,000 Leagues Under the Sea (1954)
3.312500            755                       Jumanji (1995)
3.193798             72                     Mask, The (1994)

                item_id                               title
average_rating
2.754717            892                      Flubber (1997)
2.774194            820                    Space Jam (1996)
2.820513            951  Indian in the Cupboard, The (1995)
2.914110            411         Nutty Professor, The (1996)
2.966667           1133      FairyTale: A True Story (1997)

In [22]:
#["unknown", "Action", "Adventure", "Animation", "Children's","Comedy", "Crime", "Documentary", "Drama", "Fantasy", "Film-Noir", "Horror", "Musical", "Mystery", "Romance", "Sci-Fi", "Thriller", "War", "Western"]
c= pp.Weighteditemdata(30,"Film-Noir")
for x in c:
    display(x)
# d= pp.Unweighteditemdata("Action")
# for y in d:
#     display(y)

                item_id                             title
average_rating
4.259542            657  Manchurian Candidate, The (1962)
4.210145            484        Maltese Falcon, The (1941)
4.200000            488               Sunset Blvd. (1950)
4.161616            302          L.A. Confidential (1997)
4.138182             89               Blade Runner (1982)

                item_id                         title
average_rating
2.878049            823       Mulholland Falls (1996)
2.931507            299                Hoodlum (1997)
3.385965            770  Devil in a Blue Dress (1995)
3.483146            642          Grifters, The (1990)
3.523256            673              Cape Fear (1962)

In [23]:
#["unknown", "Action", "Adventure", "Animation", "Children's","Comedy", "Crime", "Documentary", "Drama", "Fantasy", "Film-Noir", "Horror", "Musical", "Mystery", "Romance", "Sci-Fi", "Thriller", "War", "Western"]
c= pp.Weighteditemdata(30,"Horror")
for x in c:
    display(x)
# d= pp.Unweighteditemdata("Action")
# for y in d:
#     display(y)

                item_id                      title
average_rating
4.100418            185              Psycho (1960)
4.034364            183               Alien (1979)
3.945000            208  Young Frankenstein (1974)
3.825243            200        Shining, The (1980)
3.808642            443          Birds, The (1963)

                item_id                                              title
average_rating
2.448980            406                                     Thinner (1996)
2.566038            441                      Amityville Horror, The (1979)
2.636364            413  Tales from the Crypt Presents: Bordello of Blo...
2.666667            452                                      Jaws 2 (1978)
2.701493            569                                        Wolf (1994)

In [24]:
#["unknown", "Action", "Adventure", "Animation", "Children's","Comedy", "Crime", "Documentary", "Drama", "Fantasy", "Film-Noir", "Horror", "Musical", "Mystery", "Romance", "Sci-Fi", "Thriller", "War", "Western"]
c= pp.Weighteditemdata(30,"Musical")
for x in c:
    display(x)
# d= pp.Unweighteditemdata("Action")
# for y in d:
#     display(y)

                item_id                       title
average_rating
4.077236            132    Wizard of Oz, The (1939)
3.992701            705  Singin' in the Rain (1952)
3.905759            209   This Is Spinal Tap (1984)
3.836653            186  Blues Brothers, The (1980)
3.816000            485         My Fair Lady (1964)

                item_id                          title
average_rating
2.244444           1079         Joe's Apartment (1996)
2.529412            542              Pocahontas (1995)
2.720930           1091           Pete's Dragon (1977)
2.761905             21  Muppet Treasure Island (1996)
2.843750            989        Cats Don't Dance (1997)

In [25]:
#["unknown", "Action", "Adventure", "Animation", "Children's","Comedy", "Crime", "Documentary", "Drama", "Fantasy", "Film-Noir", "Horror", "Musical", "Mystery", "Romance", "Sci-Fi", "Thriller", "War", "Western"]
c= pp.Weighteditemdata(30,"Mystery")
for x in c:
    display(x)
# d= pp.Unweighteditemdata("Action")
# for y in d:
#     display(y)

                item_id                       title
average_rating
4.387560            603          Rear Window (1954)
4.333333            513       Third Man, The (1949)
4.251397            479              Vertigo (1958)
4.210145            484  Maltese Falcon, The (1941)
4.163043            191              Amadeus (1984)

                item_id                                title
average_rating
2.452381            769                         Congo (1995)
2.515152            878                That Darn Cat! (1997)
2.574803            260                 Event Horizon (1997)
2.906977            809                    Rising Sun (1993)
2.923077            342  Man Who Knew Too Little, The (1997)

In [26]:
#["unknown", "Action", "Adventure", "Animation", "Children's","Comedy", "Crime", "Documentary", "Drama", "Fantasy", "Film-Noir", "Horror", "Musical", "Mystery", "Romance", "Sci-Fi", "Thriller", "War", "Western"]
c= pp.Weighteditemdata(30,"Romance")
for x in c:
    display(x)
# d= pp.Unweighteditemdata("Action")
# for y in d:
#     display(y)

                item_id                            title
average_rating
4.456790            483                Casablanca (1942)
4.358491             50                 Star Wars (1977)
4.245714            313                   Titanic (1997)
4.204360            172  Empire Strikes Back, The (1980)
4.184211            498        African Queen, The (1951)

                item_id                                 title
average_rating
2.131579           1089        Speed 2: Cruise Control (1997)
2.166667            948                     Booty Call (1997)
2.313953            988  Beautician and the Beast, The (1997)
2.529412            542                     Pocahontas (1995)
2.538462            877                 Excess Baggage (1997)

In [27]:
#["unknown", "Action", "Adventure", "Animation", "Children's","Comedy", "Crime", "Documentary", "Drama", "Fantasy", "Film-Noir", "Horror", "Musical", "Mystery", "Romance", "Sci-Fi", "Thriller", "War", "Western"]
c= pp.Weighteditemdata(30,"Sci-Fi")
for x in c:
    display(x)
# d= pp.Unweighteditemdata("Action")
# for y in d:
#     display(y)

                item_id                                              title
average_rating
4.358491             50                                   Star Wars (1977)
4.252577            474  Dr. Strangelove or: How I Learned to Stop Worr...
4.204360            172                    Empire Strikes Back, The (1980)
4.138182             89                                Blade Runner (1982)
4.034364            183                                       Alien (1979)

                item_id                                   title
average_rating
1.933333           1215                        Barb Wire (1996)
2.157895            931        Island of Dr. Moreau, The (1996)
2.219512            577                        Coneheads (1993)
2.396825            450  Star Trek V: The Final Frontier (1989)
2.446154            145               Lawnmower Man, The (1992)

In [28]:
#["unknown", "Action", "Adventure", "Animation", "Children's","Comedy", "Crime", "Documentary", "Drama", "Fantasy", "Film-Noir", "Horror", "Musical", "Mystery", "Romance", "Sci-Fi", "Thriller", "War", "Western"]
c= pp.Weighteditemdata(30,"Thriller")
for x in c:
    display(x)
# d= pp.Unweighteditemdata("Action")
# for y in d:
#     display(y)

                item_id                                    title
average_rating
4.491071            408                    Close Shave, A (1995)
4.387560            603                       Rear Window (1954)
4.385768             12               Usual Suspects, The (1995)
4.333333            513                    Third Man, The (1949)
4.292683            963  Some Folks Call It a Sling Blade (1993)

                item_id                             title
average_rating
1.948718            743  Crow: City of Angels, The (1996)
2.131579           1089    Speed 2: Cruise Control (1997)
2.157895            931  Island of Dr. Moreau, The (1996)
2.289474           1013                   Anaconda (1997)
2.405405           1090                     Sliver (1993)

In [30]:
#["unknown", "Action", "Adventure", "Animation", "Children's","Comedy", "Crime", "Documentary", "Drama", "Fantasy", "Film-Noir", "Horror", "Musical", "Mystery", "Romance", "Sci-Fi", "Thriller", "War", "Western"]
c= pp.Weighteditemdata(30,"war")
for x in c:
    display(x)
# d= pp.Unweighteditemdata("Action")
# for y in d:
#     display(y)

                item_id                                      title
average_rating
4.102273            661                           High Noon (1952)
4.023256            589                     Wild Bunch, The (1969)
3.949074            435  Butch Cassidy and the Sundance Kid (1969)
3.942149            510              Magnificent Seven, The (1954)
3.868421            646        Once Upon a Time in the West (1969)

                item_id                                              title
average_rating
2.545455            575  City Slickers II: The Legend of Curly's Gold (...
2.660377            840                           Last Man Standing (1996)
2.772727           1188                               Young Guns II (1990)
3.100000            570                                  Wyatt Earp (1994)
3.207921            232                                  Young Guns (1988)

In [31]:
#["unknown", "Action", "Adventure", "Animation", "Children's","Comedy", "Crime", "Documentary", "Drama", "Fantasy", "Film-Noir", "Horror", "Musical", "Mystery", "Romance", "Sci-Fi", "Thriller", "War", "Western"]
c= pp.Weighteditemdata(30,"Western")
for x in c:
    display(x)
# d= pp.Unweighteditemdata("Action")
# for y in d:
#     display(y)

                item_id                                      title
average_rating
4.102273            661                           High Noon (1952)
4.023256            589                     Wild Bunch, The (1969)
3.949074            435  Butch Cassidy and the Sundance Kid (1969)
3.942149            510              Magnificent Seven, The (1954)
3.868421            646        Once Upon a Time in the West (1969)

                item_id                                              title
average_rating
2.545455            575  City Slickers II: The Legend of Curly's Gold (...
2.660377            840                           Last Man Standing (1996)
2.772727           1188                               Young Guns II (1990)
3.100000            570                                  Wyatt Earp (1994)
3.207921            232                                  Young Guns (1988)

In [32]:
#["unknown", "Action", "Adventure", "Animation", "Children's","Comedy", "Crime", "Documentary", "Drama", "Fantasy", "Film-Noir", "Horror", "Musical", "Mystery", "Romance", "Sci-Fi", "Thriller", "War", "Western"]
d= pp.Unweighteditemdata("unknown")
for y in d:
    display(y)

                item_id                title
average_rating
3.444444            267              unknown
1.000000           1373  Good Morning (1971)

                item_id                title
average_rating
1.000000           1373  Good Morning (1971)
3.444444            267              unknown

In [33]:
#["unknown", "Action", "Adventure", "Animation", "Children's","Comedy", "Crime", "Documentary", "Drama", "Fantasy", "Film-Noir", "Horror", "Musical", "Mystery", "Romance", "Sci-Fi", "Thriller", "War", "Western"]
d= pp.Unweighteditemdata("Action")
for y in d:
    display(y)

                item_id                            title
average_rating
4.358491             50                 Star Wars (1977)
4.283293            127            Godfather, The (1972)
4.252381            174   Raiders of the Lost Ark (1981)
4.245714            313                   Titanic (1997)
4.204360            172  Empire Strikes Back, The (1980)

                item_id                                title
average_rating
1.000000           1618                 The Courtyard (1995)
1.500000           1365                  Time Tracers (1995)
1.700000           1087                  Bloodsport 2 (1995)
1.800000            247  Turbo: A Power Rangers Movie (1997)
1.833333            976                          Solo (1996)

In [34]:
#["unknown", "Action", "Adventure", "Animation", "Children's","Comedy", "Crime", "Documentary", "Drama", "Fantasy", "Film-Noir", "Horror", "Musical", "Mystery", "Romance", "Sci-Fi", "Thriller", "War", "Western"]
d= pp.Unweighteditemdata("Adventure")
for y in d:
    display(y)

                item_id                            title
average_rating
5.000000           1293                  Star Kid (1997)
4.358491             50                 Star Wars (1977)
4.252381            174   Raiders of the Lost Ark (1981)
4.231214            511        Lawrence of Arabia (1962)
4.204360            172  Empire Strikes Back, The (1980)

                item_id                                           title
average_rating
1.500000            897                             Time Tracers (1995)
1.740741            457                 Free Willy 3: The Rescue (1997)
1.800000            247             Turbo: A Power Rangers Movie (1997)
1.953488            890              Mortal Kombat: Annihilation (1997)
2.000000           1383  Second Jungle Book: Mowgli & Baloo, The (1997)

In [35]:
#["unknown", "Action", "Adventure", "Animation", "Children's","Comedy", "Crime", "Documentary", "Drama", "Fantasy", "Film-Noir", "Horror", "Musical", "Mystery", "Romance", "Sci-Fi", "Thriller", "War", "Western"]
d= pp.Unweighteditemdata("Animation")
for y in d:
    display(y)

                item_id                                              title
average_rating
4.491071            408                              Close Shave, A (1995)
4.466102            169                         Wrong Trousers, The (1993)
4.447761            114  Wallace & Gromit: The Best of Aardman Animatio...
4.200000           1367                                       Faust (1994)
4.106061            189                            Grand Day Out, A (1992)

                item_id                                              title
average_rating
1.666667           1412  Land Before Time III: The Time of the Great Gi...
1.866667            103                     All Dogs Go to Heaven 2 (1996)
2.250000           1076                             Pagemaster, The (1994)
2.529412            542                                  Pocahontas (1995)
2.600000           1470                            Gumby: The Movie (1995)

In [36]:
#["unknown", "Action", "Adventure", "Animation", "Children's","Comedy", "Crime", "Documentary", "Drama", "Fantasy", "Film-Noir", "Horror", "Musical", "Mystery", "Romance", "Sci-Fi", "Thriller", "War", "Western"]
d= pp.Unweighteditemdata("Children's")
for y in d:
    display(y)

                item_id                     title
average_rating
5.000000           1293           Star Kid (1997)
4.077236            132  Wizard of Oz, The (1939)
3.995434              8               Babe (1995)
3.903226            500      Fly Away Home (1996)
3.878319              1          Toy Story (1995)

                item_id                                        title
average_rating
1.000000            314  3 Ninjas: High Noon At Mega Mountain (1998)
1.666667           1412                        Simple Wish, A (1997)
1.740741            457              Free Willy 3: The Rescue (1997)
1.800000           1336          Turbo: A Power Rangers Movie (1997)
1.866667            103               All Dogs Go to Heaven 2 (1996)

In [37]:
#["unknown", "Action", "Adventure", "Animation", "Children's","Comedy", "Crime", "Documentary", "Drama", "Fantasy", "Film-Noir", "Horror", "Musical", "Mystery", "Romance", "Sci-Fi", "Thriller", "War", "Western"]
d= pp.Unweighteditemdata("Comedy")
for y in d:
    display(y)

                item_id                       title
average_rating
5.000000           1500   Santa with Muscles (1996)
4.491071            408       Close Shave, A (1995)
4.466102            169  Wrong Trousers, The (1993)
4.284916            480   North by Northwest (1959)
4.260870            251      Shall We Dance? (1996)

                item_id                                title
average_rating
1.000000           1659                   Yankee Zulu (1994)
1.333333           1420  Gilligan's Island: The Movie (1998)
1.400000            104                  Theodore Rex (1995)
1.500000           1644              Sudden Manhattan (1996)
1.571429           1246                   Bushwhacked (1995)

In [38]:
#["unknown", "Action", "Adventure", "Animation", "Children's","Comedy", "Crime", "Documentary", "Drama", "Fantasy", "Film-Noir", "Horror", "Musical", "Mystery", "Romance", "Sci-Fi", "Thriller", "War", "Western"]
d= pp.Unweighteditemdata("Crime")
for y in d:
    display(y)

                item_id                            title
average_rating
5.000000           1122   They Made Me a Criminal (1939)
4.385768             12       Usual Suspects, The (1995)
4.333333           1191  Letter From Death Row, A (1998)
4.283293            127            Godfather, The (1972)
4.250000           1064                 Crossfire (1947)

                item_id                               title
average_rating
1.000000           1618               Lashou shentan (1992)
2.000000           1669  Truth or Consequences, N.M. (1997)
2.142857           1151            Original Gangstas (1996)
2.166667           1534                    Twin Town (1997)
2.238806            120                   Striptease (1996)

In [39]:
#["unknown", "Action", "Adventure", "Animation", "Children's","Comedy", "Crime", "Documentary", "Drama", "Fantasy", "Film-Noir", "Horror", "Musical", "Mystery", "Romance", "Sci-Fi", "Thriller", "War", "Western"]
d= pp.Unweighteditemdata("Documentary")
for y in d:
    display(y)

                item_id                                              title
average_rating
5.000000           1201         Marlene Dietrich: Shadow and Light (1996)
4.500000           1594             Maya Lin: A Strong Clear Vision (1994)
4.094017             48                                 Hoop Dreams (1994)
4.050000            320  Paradise Lost: The Child Murders at Robin Hood...
4.045455           1142                          When We Were Kings (1996)

                item_id                                          title
average_rating
1.000000           1562     Tigrero: A Film That Was Never Made (1994)
1.333333           1318                                 Catwalk (1995)
1.500000           1307  Carmen Miranda: Bananas Is My Business (1994)
2.200000           1378                          Rhyme & Reason (1997)
2.470588           1232                  Madonna: Truth or Dare (1991)

In [40]:
#["unknown", "Action", "Adventure", "Animation", "Children's","Comedy", "Crime", "Documentary", "Drama", "Fantasy", "Film-Noir", "Horror", "Musical", "Mystery", "Romance", "Sci-Fi", "Thriller", "War", "Western"]
d= pp.Unweighteditemdata("Drama")
for y in d:
    display(y)

                item_id                           title
average_rating
5.000000           1653  They Made Me a Criminal (1939)
4.625000           1449          Pather Panchali (1955)
4.500000           1642        Some Mother's Son (1996)
4.466443            318         Schindler's List (1993)
4.456790            483               Casablanca (1942)

                item_id                            title
average_rating
1.000000           1678               Yankee Zulu (1994)
1.500000           1365          Johnny 100 Pesos (1993)
1.666667           1384                   Squeeze (1996)
1.740741            457  Free Willy 3: The Rescue (1997)
1.750000           1539           Neon Bible, The (1995)

In [41]:
#["unknown", "Action", "Adventure", "Animation", "Children's","Comedy", "Crime", "Documentary", "Drama", "Fantasy", "Film-Noir", "Horror", "Musical", "Mystery", "Romance", "Sci-Fi", "Thriller", "War", "Western"]
d= pp.Unweighteditemdata("Fantasy")
for y in d:
    display(y)

                item_id                                title
average_rating
5.000000           1293                      Star Kid (1997)
3.833333            423    E.T. the Extra-Terrestrial (1982)
3.671429            558            Heavenly Creatures (1994)
3.500000            141  20,000 Leagues Under the Sea (1954)
3.312500            755                       Jumanji (1995)

                item_id                              title
average_rating
1.000000           1576     Hungarian Fairy Tale, A (1987)
1.666667           1292              Simple Wish, A (1997)
1.800000           1336                      Kazaam (1996)
2.166667            548  NeverEnding Story III, The (1994)
2.250000           1076             Pagemaster, The (1994)

In [42]:
#["unknown", "Action", "Adventure", "Animation", "Children's","Comedy", "Crime", "Documentary", "Drama", "Fantasy", "Film-Noir", "Horror", "Musical", "Mystery", "Romance", "Sci-Fi", "Thriller", "War", "Western"]
d= pp.Unweighteditemdata("Film-Noir")
for y in d:
    display(y)

                item_id                             title
average_rating
4.259542            657  Manchurian Candidate, The (1962)
4.250000           1064                  Crossfire (1947)
4.210145            484        Maltese Falcon, The (1941)
4.200000            488               Sunset Blvd. (1950)
4.161616            302          L.A. Confidential (1997)

                item_id                    title
average_rating
1.000000           1582             T-Men (1947)
2.000000           1476          Raw Deal (1948)
2.250000           1422            Suture (1993)
2.878049            823  Mulholland Falls (1996)
2.931507            299           Hoodlum (1997)

In [43]:
#["unknown", "Action", "Adventure", "Animation", "Children's","Comedy", "Crime", "Documentary", "Drama", "Fantasy", "Film-Noir", "Horror", "Musical", "Mystery", "Romance", "Sci-Fi", "Thriller", "War", "Western"]
d= pp.Unweighteditemdata("Horror")
for y in d:
    display(y)

                item_id                      title
average_rating
4.100418            185              Psycho (1960)
4.034364            183               Alien (1979)
4.000000           1625          Nightwatch (1997)
3.945000            208  Young Frankenstein (1974)
3.857143            853           Braindead (1992)

                item_id                                       title
average_rating
1.000000            858                        Beyond Bedlam (1993)
1.166667            438                       Amityville 3-D (1983)
1.250000            777                         Castle Freak (1995)
1.315789            424  Children of the Corn: The Gathering (1996)
1.500000           1371                         Machine, The (1994)

In [44]:
#["unknown", "Action", "Adventure", "Animation", "Children's","Comedy", "Crime", "Documentary", "Drama", "Fantasy", "Film-Noir", "Horror", "Musical", "Mystery", "Romance", "Sci-Fi", "Thriller", "War", "Western"]
d= pp.Unweighteditemdata("Musical")
for y in d:
    display(y)

                item_id                         title
average_rating
4.077236            132      Wizard of Oz, The (1939)
4.047619           1203                Top Hat (1935)
4.000000           1458  Damsel in Distress, A (1937)
3.992701            705    Singin' in the Rain (1952)
3.905759            209     This Is Spinal Tap (1984)

                item_id                           title
average_rating
1.866667            103  All Dogs Go to Heaven 2 (1996)
2.000000           1037                 Grease 2 (1982)
2.115385            352              Spice World (1997)
2.244444           1079          Joe's Apartment (1996)
2.529412            542               Pocahontas (1995)

In [45]:
#["unknown", "Action", "Adventure", "Animation", "Children's","Comedy", "Crime", "Documentary", "Drama", "Fantasy", "Film-Noir", "Horror", "Musical", "Mystery", "Romance", "Sci-Fi", "Thriller", "War", "Western"]
d= pp.Unweighteditemdata("Mystery")
for y in d:
    display(y)

                item_id                       title
average_rating
4.387560            603          Rear Window (1954)
4.333333            513       Third Man, The (1949)
4.251397            479              Vertigo (1958)
4.210145            484  Maltese Falcon, The (1941)
4.163043            191              Amadeus (1984)

                item_id                          title
average_rating
1.000000           1581  Woman in Question, The (1950)
2.000000           1669       MURDER and murder (1996)
2.200000            574           Boxing Helena (1993)
2.250000           1003          That Darn Cat! (1997)
2.452381            769                   Congo (1995)

In [46]:
#["unknown", "Action", "Adventure", "Animation", "Children's","Comedy", "Crime", "Documentary", "Drama", "Fantasy", "Film-Noir", "Horror", "Musical", "Mystery", "Romance", "Sci-Fi", "Thriller", "War", "Western"]
d= pp.Unweighteditemdata("Romance")
for y in d:
    display(y)

                item_id                            title
average_rating
4.456790            483                Casablanca (1942)
4.358491             50                 Star Wars (1977)
4.245714            313                   Titanic (1997)
4.204360            172  Empire Strikes Back, The (1980)
4.192308            966    Affair to Remember, An (1957)

                item_id                               title
average_rating
1.000000           1580        Vermont Is For Lovers (1992)
1.500000           1502            Naked in New York (1994)
1.666667           1652    Temptress Moon (Feng Yue) (1996)
1.833333            545          Vampire in Brooklyn (1995)
2.000000           1680  Truth or Consequences, N.M. (1997)

In [47]:
#["unknown", "Action", "Adventure", "Animation", "Children's","Comedy", "Crime", "Documentary", "Drama", "Fantasy", "Film-Noir", "Horror", "Musical", "Mystery", "Romance", "Sci-Fi", "Thriller", "War", "Western"]
d= pp.Unweighteditemdata("Sci-Fi")
for y in d:
    display(y)

                item_id                                              title
average_rating
5.000000           1293                                    Star Kid (1997)
4.358491             50                                   Star Wars (1977)
4.252577            474  Dr. Strangelove or: How I Learned to Stop Worr...
4.204360            172                    Empire Strikes Back, The (1980)
4.138182             89                                Blade Runner (1982)

                item_id                                      title
average_rating
1.500000            897                        Time Tracers (1995)
1.714286            758  Lawnmower Man 2: Beyond Cyberspace (1996)
1.727273           1274                           Robocop 3 (1993)
1.833333            976                                Solo (1996)
1.933333           1215                           Barb Wire (1996)

In [48]:
#["unknown", "Action", "Adventure", "Animation", "Children's","Comedy", "Crime", "Documentary", "Drama", "Fantasy", "Film-Noir", "Horror", "Musical", "Mystery", "Romance", "Sci-Fi", "Thriller", "War", "Western"]
d= pp.Unweighteditemdata("Thriller")
for y in d:
    display(y)

                item_id                                    title
average_rating
4.491071            408                    Close Shave, A (1995)
4.387560            603                       Rear Window (1954)
4.385768             12               Usual Suspects, The (1995)
4.333333            513                    Third Man, The (1949)
4.292683            963  Some Folks Call It a Sling Blade (1993)

                item_id                                      title
average_rating
1.000000           1621                       The Courtyard (1995)
1.500000           1549                           Dream Man (1995)
1.666667            788                       Relative Fear (1994)
1.714286            758  Lawnmower Man 2: Beyond Cyberspace (1996)
1.727273           1274                           Robocop 3 (1993)

In [49]:
#["unknown", "Action", "Adventure", "Animation", "Children's","Comedy", "Crime", "Documentary", "Drama", "Fantasy", "Film-Noir", "Horror", "Musical", "Mystery", "Romance", "Sci-Fi", "Thriller", "War", "Western"]
d= pp.Unweighteditemdata("War")
for y in d:
    display(y)

                item_id                                              title
average_rating
4.466443            318                            Schindler's List (1993)
4.456790            483                                  Casablanca (1942)
4.358491             50                                   Star Wars (1977)
4.252577            474  Dr. Strangelove or: How I Learned to Stop Worr...
4.231214            511                          Lawrence of Arabia (1962)

                item_id                     title
average_rating
1.000000           1574     Pharaoh's Army (1995)
2.000000           1663   Nothing Personal (1995)
2.188406            687      McHale's Navy (1997)
2.250000           1423  Walking Dead, The (1995)
2.277778           1185    In the Army Now (1994)

In [50]:
#["unknown", "Action", "Adventure", "Animation", "Children's","Comedy", "Crime", "Documentary", "Drama", "Fantasy", "Film-Noir", "Horror", "Musical", "Mystery", "Romance", "Sci-Fi", "Thriller", "War", "Western"]
d= pp.Unweighteditemdata("Western")
for y in d:
    display(y)

                item_id                                      title
average_rating
4.102273            661                           High Noon (1952)
4.023256            589                     Wild Bunch, The (1969)
3.949074            435  Butch Cassidy and the Sundance Kid (1969)
3.942149            510              Magnificent Seven, The (1954)
3.868421            646        Once Upon a Time in the West (1969)

                item_id                                              title
average_rating
1.000000           1587                      Terror in a Texas Town (1958)
1.833333           1247                                   Bad Girls (1994)
2.500000           1455                                   Wild Bill (1995)
2.545455            575  City Slickers II: The Legend of Curly's Gold (...
2.660377            840                           Last Man Standing (1996)